InformationRegisters/Renault_ЗапросыAp2Ap.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Renault_ЗапросыAp2Ap</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Renault_ЗапросыAp2Ap/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Функция ПоказатьЗапросНаСервере(ТекущиеДанные)
	Менеджер = РегистрыСведений.ЗапросыAp2Ap.СоздатьМенеджерЗаписи();
	Менеджер.BIR = ТекущиеДанные.BIR;
	Менеджер.Ключ = ТекущиеДанные.Ключ;
	Менеджер.Прочитать();
	Возврат Менеджер.ТекстЗапроса.Получить();
КонецФункции

&НаКлиенте
Процедура ПоказатьЗапрос(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаОтвет = ПоказатьЗапросНаСервере(ТекущиеДанные);
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(СтрокаОтвет);
	Тд.Показать();
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтвет(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаОтвет = ПоказатьОтветНаСервере(ТекущиеДанные);
	ТД = Новый ТекстовыйДокумент;
	ТД.УстановитьТекст(СтрокаОтвет);
	Тд.Показать();
КонецПроцедуры

&НаСервере
Функция ПоказатьОтветНаСервере (ТекущиеДанные)
	Менеджер = РегистрыСведений.ЗапросыAp2Ap.СоздатьМенеджерЗаписи();
	Менеджер.BIR = ТекущиеДанные.BIR;
	Менеджер.Ключ = ТекущиеДанные.Ключ;
	Менеджер.Прочитать();
	Возврат Менеджер.ТекстОтвета.Получить();
КонецФункции
